geosmall/Arduino_Core_STM32/cores/arduino/sys/system.cpp
    // Initialize Caches
    if(config.use_dcache)
        SCB_EnableDCache();
    if(config.use_icache)
        SCB_EnableICache();

    // Configure and start highspeed timer.
    // TIM 2 counter UP (defaults to fastest tick/longest period).
    TimerHandle::Config timcfg;
    timcfg.periph = TimerHandle::Config::Peripheral::TIM_2;
    timcfg.dir    = TimerHandle::Config::CounterDir::UP;
    tim_.Init(timcfg);
    tim_.Start();

    // Initialize the true random number generator
    Random::Init();
}

void System::DeInit()
{
    dsy_dma_deinit();
    // HAL_MPU_Disable();
    // The I2C global init doesn't actually initialize the periph,
    // so no need to deinitialize
    SCB_DisableDCache();
    SCB_DisableICache();

    tim_.DeInit();
    // HAL_RCC_DeInit();

    // WARNING -- without modifications, this function will
    // cause the device to reset, preventing program loading
    // HAL_DeInit();
}

void System::JumpToQspi()
{
    __JUMPTOQSPI();
    while(1) {}
}

uint32_t System::GetNow()
{
    return HAL_GetTick();
}

uint32_t System::GetUs()
{
    return tim_.GetUs();
}

uint32_t System::GetTick()
{
    return tim_.GetTick();
}

void System::Delay(uint32_t delay_ms)
{
    HAL_Delay(delay_ms);
}

void System::DelayUs(uint32_t delay_us)
{
    tim_.DelayUs(delay_us);
}

void System::DelayTicks(uint32_t delay_ticks)
{
    tim_.DelayTick(delay_ticks);
}

void System::ResetToBootloader(BootloaderMode mode)
{
    if(mode == BootloaderMode::STM)
    {
        // Initialize Boot Pin
        dsy_gpio_pin bootpin = {DSY_GPIOG, 3};
        dsy_gpio     pin;
        pin.mode = DSY_GPIO_MODE_OUTPUT_PP;
        pin.pin  = bootpin;
        dsy_gpio_init(&pin);

        // Pull Pin HIGH
        dsy_gpio_write(&pin, 1);

        // wait a few ms for cap to charge
        HAL_Delay(10);
    }
    else if(mode == BootloaderMode::DAISY
            || mode == BootloaderMode::DAISY_SKIP_TIMEOUT
            || mode == BootloaderMode::DAISY_INFINITE_TIMEOUT)
    {
        auto region = GetProgramMemoryRegion();
        if(region == MemoryRegion::INTERNAL_FLASH)
            return; // Cannot return to Daisy bootloader if it's not present!

        // Coming from a bootloaded program, the backup SRAM will already
        // be initialized. If the bootloader is <= v5, then it will not
        // be initialized, but a failed write will not cause a fault.
        switch(mode)
        {
            case BootloaderMode::DAISY_SKIP_TIMEOUT:
                boot_info.status = BootInfo::Type::SKIP_TIMEOUT;
                break;
            case BootloaderMode::DAISY_INFINITE_TIMEOUT:
                boot_info.status = BootInfo::Type::INF_TIMEOUT;
                break;
            default:
                // this is technically valid, just means no
                // special behavior applied on boot
                boot_info.status = BootInfo::Type::INVALID;
                break;
        }
    }
    else
    {
        return; // Malformed mode
    }

    // disable interupts
    RCC->CIER = 0x00000000;

    // Software Reset
    HAL_NVIC_SystemReset();
}

void System::InitBackupSram()
{
    PWR->CR1 |= PWR_CR1_DBP;
    while((PWR->CR1 & PWR_CR1_DBP) == RESET)
        ;
    __HAL_RCC_BKPRAM_CLK_ENABLE();
}

System::BootInfo::Version System::GetBootloaderVersion()
{
    auto region = GetProgramMemoryRegion();
    if(region == MemoryRegion::INTERNAL_FLASH)
        return BootInfo::Version::NONE;

    for(int i = 0; i < (int)BootInfo::Version::LAST; i++)
    {
        if(boot_info.version == (BootInfo::Version)i)
            return (BootInfo::Version)i;
    }

    // Otherwise, the version may be higher than this
    // version of the library knows about. In that case,
    // expecting backwards compatibility, we'll say it's
    // at least the latest version.
    return (BootInfo::Version)((int)BootInfo::Version::LAST - 1);
}

void System::ConfigureClocks()
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {};
    RCC_PeriphCLKInitTypeDef PeriphClkInitStruct = {};

    /** Supply configuration update enable
    */
    HAL_PWREx_ConfigSupply( PWR_LDO_SUPPLY );
    /** Configure the main internal regulator output voltage
     *  Run mode (VOS0 to VOS3)
     *  Scale 0: boosted performance (available only with LDO regulator)
     *  Scale 1: high performance
     *  Scale 2: medium performance and consumption
     *  Scale 3: optimized performance and low-power consumption
     *
    */
    __HAL_PWR_VOLTAGESCALING_CONFIG( PWR_REGULATOR_VOLTAGE_SCALE0 );

    while ( !__HAL_PWR_GET_FLAG( PWR_FLAG_VOSRDY ) ) {}
    /** Initializes the RCC Oscillators according to the specified parameters
    * in the RCC_OscInitTypeDef structure.
    */
    /* PLL1 pclk is sysclk 480 Mhz */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    // 480 Mhz
    RCC_OscInitStruct.PLL.PLLM = 5; // M div 5
    RCC_OscInitStruct.PLL.PLLN = 96; // N mul 96
    RCC_OscInitStruct.PLL.PLLP = 1; // P div 1
    RCC_OscInitStruct.PLL.PLLQ = 10; // Q div 10 - USB 48 Mhz
    RCC_OscInitStruct.PLL.PLLR = 10; // R unused
    // 360 Mhz
    /*
    RCC_OscInitStruct.PLL.PLLM = 5; // M div 10
    RCC_OscInitStruct.PLL.PLLN = 144; // N mul 144 (add 1 to N)
    RCC_OscInitStruct.PLL.PLLP = 2; // P div 2 (add 1 to PLLP) must be even
    RCC_OscInitStruct.PLL.PLLQ = 15; // Q div 10 (add 1 to PLLQ) - USB 48 Mhz
    RCC_OscInitStruct.PLL.PLLR = 15; // R unused
    */

    /*
     * RCC_PLL1VCIRANGE_0  Clock range frequency between 1 and 2 MHz
     * RCC_PLL1VCIRANGE_1  Clock range frequency between 2 and 4 MHz
     * RCC_PLL1VCIRANGE_2  Clock range frequency between 4 and 8 MHz
     * RCC_PLL1VCIRANGE_3  Clock range frequency between 8 and 16 MHz */
    /* PLLRGE: RCC_PLL1VCIRANGE_2 Clock range frequency between 4 and 8 MHz  */
    RCC_OscInitStruct.PLL.PLLRGE = RCC_PLL1VCIRANGE_2;
    /* VCOSEL PLL1VCOWIDE 2-16 Mhz */
    RCC_OscInitStruct.PLL.PLLVCOSEL = RCC_PLL1VCOWIDE;
    RCC_OscInitStruct.PLL.PLLFRACN = 0;
    if ( HAL_RCC_OscConfig( &RCC_OscInitStruct ) != HAL_OK )
    {
        Error_Handler();
    }
    /** Initializes the CPU, AHB and APB buses clocks
    */
    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK
                                  | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2
                                  | RCC_CLOCKTYPE_D3PCLK1 | RCC_CLOCKTYPE_D1PCLK1;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB3CLKDivider = RCC_APB3_DIV2;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_APB2_DIV2;
    RCC_ClkInitStruct.APB4CLKDivider = RCC_APB4_DIV2;
    if ( HAL_RCC_ClockConfig( &RCC_ClkInitStruct, FLASH_LATENCY_4 ) != HAL_OK )
    {
        Error_Handler();
    }

    PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_USB | RCC_PERIPHCLK_QSPI
            | RCC_PERIPHCLK_SDMMC | RCC_PERIPHCLK_ADC
            | RCC_PERIPHCLK_LPUART1 | RCC_PERIPHCLK_USART16
            | RCC_PERIPHCLK_USART234578 | RCC_PERIPHCLK_I2C123
            | RCC_PERIPHCLK_I2C4 | RCC_PERIPHCLK_SPI123
            | RCC_PERIPHCLK_SPI45 | RCC_PERIPHCLK_SPI6;

    /* PLL1 qclk used for USB 48 Mhz */
    /* PLL1 qclk also used for FMC, QUADSPI, SDMMC, RNG, SAI */
    /* PLL2 pclk is needed for adc max 80 Mhz (p,q,r same) */
    /* PLL2 pclk also used for LP timers 2,3,4,5, SPI 1,2,3 */
    /* PLL2 qclk is needed for uart, can, spi4,5,6 80 Mhz */
    /* PLL3 r clk is needed for i2c 80 Mhz (p,q,r same) */
    PeriphClkInitStruct.PLL2.PLL2M = 15; // M DIV 15 vco 25 / 15 ~ 1.667 Mhz
    PeriphClkInitStruct.PLL2.PLL2N = 96; // N MUL 96
    PeriphClkInitStruct.PLL2.PLL2P = 2;  // P div 2
    PeriphClkInitStruct.PLL2.PLL2Q = 2;  // Q div 2
    PeriphClkInitStruct.PLL2.PLL2R = 2;  // R div 2
    // RCC_PLL1VCIRANGE_0  Clock range frequency between 1 and 2 MHz
    PeriphClkInitStruct.PLL2.PLL2RGE = RCC_PLL2VCIRANGE_0;
    PeriphClkInitStruct.PLL2.PLL2VCOSEL = RCC_PLL2VCOMEDIUM;
    PeriphClkInitStruct.PLL2.PLL2FRACN = 0;
    PeriphClkInitStruct.PLL3.PLL3M = 15; // M DIV 15 vco 25 / 15 ~ 1.667 Mhz
    PeriphClkInitStruct.PLL3.PLL3N = 96; // N MUL 96
    PeriphClkInitStruct.PLL3.PLL3P = 2;  // P div 2
    PeriphClkInitStruct.PLL3.PLL3Q = 2;  // Q div 2
    PeriphClkInitStruct.PLL3.PLL3R = 2;  // R div 2
    // RCC_PLL1VCIRANGE_0  Clock range frequency between 1 and 2 MHz
    PeriphClkInitStruct.PLL3.PLL3RGE = RCC_PLL3VCIRANGE_0;
    PeriphClkInitStruct.PLL3.PLL3VCOSEL = RCC_PLL3VCOMEDIUM;
    PeriphClkInitStruct.PLL3.PLL3FRACN = 0;
    // ADC from PLL2 pclk
    PeriphClkInitStruct.AdcClockSelection = RCC_ADCCLKSOURCE_PLL2;
    // USB from PLL1 qclk
    PeriphClkInitStruct.UsbClockSelection = RCC_USBCLKSOURCE_PLL;
    // QSPI from PLL1 qclk
    PeriphClkInitStruct.QspiClockSelection = RCC_QSPICLKSOURCE_PLL;
    // SDMMC from PLL1 qclk
    PeriphClkInitStruct.SdmmcClockSelection = RCC_SDMMCCLKSOURCE_PLL;
    // LPUART from PLL2 qclk
    PeriphClkInitStruct.Lpuart1ClockSelection = RCC_LPUART1CLKSOURCE_PLL2;
    // USART from PLL2 qclk
    PeriphClkInitStruct.Usart16ClockSelection = RCC_USART16CLKSOURCE_PLL2;
    // USART from PLL2 qclk
    PeriphClkInitStruct.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_PLL2;
    // I2C123 from PLL3 rclk
    PeriphClkInitStruct.I2c123ClockSelection = RCC_I2C123CLKSOURCE_PLL3;
    // I2C4 from PLL3 rclk
    PeriphClkInitStruct.I2c4ClockSelection = RCC_I2C4CLKSOURCE_PLL3;
    // SPI123 from PLL2 pclk
    PeriphClkInitStruct.Spi123ClockSelection = RCC_SPI123CLKSOURCE_PLL2;
    // SPI45 from PLL2 qclk
    PeriphClkInitStruct.Spi45ClockSelection = RCC_SPI45CLKSOURCE_PLL2;
    // SPI6 from PLL2 qclk
    PeriphClkInitStruct.Spi6ClockSelection = RCC_SPI6CLKSOURCE_PLL2;


